structurizr-export/test/unit/com/structurizr/io/dot/groups-SystemLandscape.dot
digraph {
  compound=true
  graph [fontname="Arial", rankdir=TB, ranksep=1.0, nodesep=1.0]
  node [fontname="Arial", shape=box, margin="0.4,0.3"]
  edge [fontname="Arial"]
  label=<<br /><font point-size="34">System Landscape for Enterprise</font>>

  subgraph cluster_enterprise {
    margin=25
    label=<<font point-size="24"><br />Enterprise</font><br /><font point-size="19">[Enterprise]</font>>
    labelloc=b
    color="#444444"
    fontcolor="#444444"
    fillcolor="#ffffff"

    subgraph "cluster_group_Group 2" {
      margin=25
      label=<<font point-size="24"><br />Group 2</font><br /><font point-size="19">[Group]</font>>
      labelloc=b
      color="#cccccc"
      fontcolor="#cccccc"
      fillcolor="#ffffff"

      4 [id=4,shape=rect, label=<<font point-size="34">D</font><br /><font point-size="19">[Software System]</font>>, style=filled, color="#9a9a9a", fillcolor="#dddddd", fontcolor="#000000"]
    }

    3 [id=3,shape=rect, label=<<font point-size="34">C</font><br /><font point-size="19">[Software System]</font>>, style=filled, color="#9a9a9a", fillcolor="#dddddd", fontcolor="#000000"]
  }

  subgraph "cluster_group_Group 1" {
    margin=25
    label=<<font point-size="24"><br />Group 1</font><br /><font point-size="19">[Group]</font>>
    labelloc=b
    color="#cccccc"
    fontcolor="#cccccc"
    fillcolor="#ffffff"

    2 [id=2,shape=rect, label=<<font point-size="34">B</font><br /><font point-size="19">[Software System]</font>>, style=filled, color="#9a9a9a", fillcolor="#dddddd", fontcolor="#000000"]
  }

  1 [id=1,shape=rect, label=<<font point-size="34">A</font><br /><font point-size="19">[Software System]</font>>, style=filled, color="#9a9a9a", fillcolor="#dddddd", fontcolor="#000000"]

  2 -> 3 [id=10, label=<>, style="dashed", color="#707070", fontcolor="#707070"]
  3 -> 4 [id=12, label=<>, style="dashed", color="#707070", fontcolor="#707070"]
  1 -> 2 [id=9, label=<>, style="dashed", color="#707070", fontcolor="#707070"]
}
